In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/010.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

,0,1,2,3,4,5
0,NaN,NaN,NaN,"Black (R) 846,395","Irvin (D) 1,168,371","Cashin (Lib) 70,015"
1,NaN,NaN,NaN,40.6%,56.0%,3.4%
2,County,PR,TP,NaN,NaN,NaN
3,APPLING,19,19,1823,2156,65
4,ATKINSON,6,6,695,728,22

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4    5
3   APPLING  19  19  1823  2156   65
4  ATKINSON   6   6   695   728   22
5     BACON   7   7   969  1262   44
6     BAKER   7   7   299   662   12
7   BALDWIN  16  16  3133  6525  190

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4    5
3   APPLING  1823  2156   65
4  ATKINSON   695   728   22
5     BACON   969  1262   44
6     BAKER   299   662   12
7   BALDWIN  3133  6525  190

In [9]:
df.columns = ['county', 'Gary Black', 'Tommy Irvin', 'Jack Cashin']

In [10]:
df.tail(5)

        county Gary Black Tommy Irvin Jack Cashin
157  WHITFIELD       8224        7742         376
158     WILCOX        908        1012          27
159     WILKES        929        1715          46
160  WILKINSON        844        1914          28
161      WORTH       2372        2530          63

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county   candidate votes
0   APPLING  Gary Black  1823
1  ATKINSON  Gary Black   695
2     BACON  Gary Black   969
3     BAKER  Gary Black   299
4   BALDWIN  Gary Black  3133

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 477 entries, 0 to 476
Data columns (total 3 columns):
county       477 non-null object
candidate    477 non-null object
votes        477 non-null int64
dtypes: int64(1), object(2)
memory usage: 11.3+ KB

In [16]:
df['office'] = 'Commissioner Of Agriculture'

In [17]:
df['district'] = ''

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Gary Black', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Tommy Irvin', 'party'] = 'Democrat'
df.loc[df['candidate'] == 'Jack Cashin', 'party'] = 'Libertarian'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate    party
Gary Black   Republican      846395
Jack Cashin  Libertarian      70015
Tommy Irvin  Democrat       1168371
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Commissioner Of Agriculture,,Republican,Gary Black,1823
1,ATKINSON,Commissioner Of Agriculture,,Republican,Gary Black,695
2,BACON,Commissioner Of Agriculture,,Republican,Gary Black,969
3,BAKER,Commissioner Of Agriculture,,Republican,Gary Black,299
4,BALDWIN,Commissioner Of Agriculture,,Republican,Gary Black,3133

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')